Revit 2027 API
PropertyLine.SketchId Property
 Get the sketch Id of the PropertyLine element if it is sketch-based. Otherwise it will return invalidElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SketchId { get; }
Public ReadOnly Property SketchId As ElementId
	Get
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
member SketchId : ElementId with get
Property Value
ElementId
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace